Update brainstorm diagrams to be mermaid so they render on github
